%% ************************************在论文中的图*********************************************
%% 数据来自多次仿真结果
clear;
close all;

% lambda_f =10   u_f = 10   ut=25
reward1 = [4490.26141660294,2940.51134206898;6298.24054193023,4442.65735873066;8534.48654848021,6403.39534337694;11076.5942302867,8738.59952963908;13780.6057574028,11329.5586945328;16320.1342764877,13863.7647484180;18259.3397527583,15881.3004027515;18730.7041969494,16567.7908068135];
figure
x1 = 5:1:12;
plot(x1,reward1(:,1),'--or','linewidth',1.5);
hold on;
plot(x1,reward1(:,2),'--^b','linewidth',1.5);
hold on;
xlabel('最大车辆数目 ({\mu_{\itt}=25})');
ylabel('系统长期收益');
% axis([5 12 100 125]);
legend('SMDP策略','贪婪策略','Location','NorthWest');
for i1 = 1:8
    ratio1(i1,1)=(reward1(i1,1)-reward1(i1,2))/reward1(i1,2);
end
average1=sum(ratio1)/8

% lambda_f =10   u_f = 10   ut=50
reward2=[4023.87739858696,3111.39750716108;5829.96777279631,4747.66624165003;8171.05961280861,6933.29634336149;10934.2043326544,9576.78092256874;14029.1053155048,12601.2256173447;17203.2845337256,15738.6885037692;20086.2362020623,18635.3136609992;22298.2332997211,20893.2971945183];
figure
x2 = 5:1:12;
plot(x2,reward2(:,1),'--or','linewidth',1.5);
hold on;
plot(x2,reward2(:,2),'--^b','linewidth',1.5);
hold on;
xlabel('最大车辆数目 ({\mu_{\itt}=50})');
ylabel('系统长期收益');
% axis([5 12 100 125]);
legend('SMDP策略','贪婪策略','Location','NorthWest');
for i2 = 1:8
    ratio2(i2,1)=(reward2(i2,1)-reward2(i2,2))/reward2(i2,2);
end
average2=sum(ratio2)/8
